app/views/users/_form.html.erb

SELECT "divisions".* FROM "divisions"
---
    <%= f.label :division_id %><br>
    <%= f.select :division_id, Division.all.collect {|division| [ division.name, division.id ] } %>

SELECT "levels".* FROM "levels"
---
    <%= f.label :level_id %><br>
    <%= f.select :level_id, Level.all.collect {|level| [ level.name, level.id ] } %>