app/views/users/index.html.erb

SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", 2]]
SELECT "levels".* FROM "levels" WHERE "levels"."id" = ? LIMIT 1  [["id", 1]]
---
        <td><%= user.email %></td>
        <td><%= Division.find(user.division_id).name %></td>
        <td><%= Level.find(user.level_id).name %></td>