app/views/bookingrooms/_form.html.erb

    <%= f.label :room_id %><br>
    <%= f.select :room_id, Room.all.collect {|room| [ room.name, room.id ] } %>
---
SELECT "rooms".* FROM "rooms"

    <%= f.label :user_id %><br>
    <%= f.select :user_id, User.where(level_id: 3).collect {|user| [ user.name, user.id ] } %>
---
SELECT "users".* FROM "users" WHERE "users"."level_id" = 3