app/views/bookingcars/_form.html.erb

    <%= f.label :car_id %><br>
    <%= f.select :car_id, Car.all.collect {|car| [ car.police_number, car.id ] } %>
---
SELECT "cars".* FROM "cars"

    <%= f.label :user_id %><br>
    <%= f.select :user_id, User.where(level_id: 3).collect {|user| [ user.name, user.id ] } %>
---
SELECT "users".* FROM "users" WHERE "users"."level_id" = 3