app/views/bookingcars/index.html.erb

      <tr>
        <td><%= Car.find(bookingcar.car_id).police_number %></td>
        <td><%= User.find(bookingcar.user_id).name %></td>
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]