app/controllers/bookingrooms_controller.rb

SELECT "bookingrooms".* FROM "bookingrooms"
---
  def index
    @bookingrooms = Bookingroom.all