app/controllers/bookingcars_controller.rb

  def index
    @bookingcars = Bookingcar.all
---
SELECT "bookingcars".* FROM "bookingcars"

  def create
    @bookingcar = Bookingcar.new(bookingcar_params)

    respond_to do |format|
      if @bookingcar.save
---
INSERT INTO "bookingcars" ("car_id", "created_at", "description", "destination", "end_time", "participant", "start_time", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_bookingcar
      @bookingcar = Bookingcar.find(params[:id])
---
SELECT "bookingcars".* FROM "bookingcars" WHERE "bookingcars"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", 1]]