app/controllers/cars_controller.rb

  def index
    @cars = Car.all
---
SELECT "cars".* FROM "cars"

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("capacity", "created_at", "driver_id", "merk", "police_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["capacity", 12], ["created_at", Tue, 24 Dec 2013 16:35:35 UTC +00:00], ["driver_id", 5], ["merk", "Suzuki R3"], ["police_number", "B1WOI"], ["updated_at", Tue, 24 Dec 2013 16:35:35 UTC +00:00]]

    def set_car
      @car = Car.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", "1"]]