app/controllers/divisions_controller.rb

SELECT "divisions".* FROM "divisions"
---
  def index
    @divisions = Division.all

INSERT INTO "divisions" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 24 Dec 2013 15:31:46 UTC +00:00], ["description", ""], ["name", ""], ["updated_at", Tue, 24 Dec 2013 15:31:46 UTC +00:00]]
---
  def create
    @division = Division.new(division_params)

    respond_to do |format|
      if @division.save

DELETE FROM "divisions" WHERE "divisions"."id" = ?  [["id", 1]]
---
  def destroy
    @division.destroy

SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_division
      @division = Division.find(params[:id])