app/controllers/divisions_controller.rb

SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", "980190962"]]
---
    def set_division
      @division = Division.find(params[:id])