app/controllers/levels_controller.rb

  def index
    @levels = Level.all
---
SELECT "levels".* FROM "levels"

  def create
    @level = Level.new(level_params)

    respond_to do |format|
      if @level.save
---
INSERT INTO "levels" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 24 Dec 2013 16:30:16 UTC +00:00], ["name", "Administrator"], ["updated_at", Tue, 24 Dec 2013 16:30:16 UTC +00:00]]

    def set_level
      @level = Level.find(params[:id])
---
SELECT "levels".* FROM "levels" WHERE "levels"."id" = ? LIMIT 1  [["id", "1"]]