app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.page(params[:page]).per(2)

INSERT INTO "users" ("address", "created_at", "division_id", "email", "level_id", "name", "nik", "password", "status", "telp", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "nik" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["nik", "KMK-0001"], ["updated_at", Tue, 24 Dec 2013 16:05:28 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)