app/views/cars/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."level_id" = 2
---
    <%= f.label :driver_id %><br>
    <%= f.select :driver_id, User.where(level_id: 5).collect {|driver| [ driver.name, driver.id ] } %>