app/views/cars/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
---
        <td><%= car.capacity %></td>
        <td><%= User.find(car.driver_id).name %></td>